In [72]:
import mysql.connector as db
import pandas as pd

from IPython.display import display

In [73]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select * from `sample data`"

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

,id,kemendagri_kabupaten_nama,kemendagri_kabupaten_kode,date,hour,level,geometry,avg_speed_kmh
0,8230974,KOTA BANDUNG,32.73,2020-01-01,7,2,"{'type': 'MultiLineString', 'coordinates': [[[...",14.06750
1,8230965,KOTA BANDUNG,32.73,2020-01-01,6,2,"{'type': 'MultiLineString', 'coordinates': [[[...",8.55000
2,8230966,KOTA BANDUNG,32.73,2020-01-01,6,4,"{'type': 'MultiLineString', 'coordinates': [[[...",3.94875
3,8230967,KOTA BANDUNG,32.73,2020-01-01,6,2,"{'type': 'MultiLineString', 'coordinates': [[[...",20.20710
4,8230968,KOTA BANDUNG,32.73,2020-01-01,6,2,"{'type': 'MultiLineString', 'coordinates': [[[...",40.94400
...,...,...,...,...,...,...,...,...
145,8231145,KOTA BANDUNG,32.73,2020-01-01,9,2,"{'type': 'MultiLineString', 'coordinates': [[[...",17.02500
146,8231114,KOTA BANDUNG,32.73,2020-01-01,9,2,"{'type': 'LineString', 'coordinates': [[107.61...",13.04000
147,8231115,KOTA BANDUNG,32.73,2020-01-01,9,2,"{'type': 'MultiLineString', 'coordinates': [[[...",17.73760
148,8231116,KOTA BANDUNG,32.73,2020-01-01,9,3,"{'type': 'MultiLineString', 'coordinates': [[[...",12.53960
149,8231117,KOTA BANDUNG,32.73,2020-01-01,9,4,"{'type': 'MultiLineString', 'coordinates': [[[...",5.43000

In [74]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select hour from `sample data` order by date asc"

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

     hour
0       7
1       6
2       6
3       6
4       6
..    ...
145     9
146     9
147     9
148     9
149     9

[150 rows x 1 columns]

In [75]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select geometry locations, count(level) level_5 from `sample data` where level = 5 group by geometry"

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

                                            locations  level_5
0   {'type': 'MultiLineString', 'coordinates': [[[...        1
1   {'type': 'MultiLineString', 'coordinates': [[[...        1
2   {'type': 'MultiLineString', 'coordinates': [[[...        1
3   {'type': 'MultiLineString', 'coordinates': [[[...        1
4   {'type': 'MultiLineString', 'coordinates': [[[...        1
5   {'type': 'MultiLineString', 'coordinates': [[[...        1
6   {'type': 'MultiLineString', 'coordinates': [[[...        1
7   {'type': 'MultiLineString', 'coordinates': [[[...        1
8   {'type': 'MultiLineString', 'coordinates': [[[...        1
9   {'type': 'MultiLineString', 'coordinates': [[[...        1
10  {'type': 'MultiLineString', 'coordinates': [[[...        1

In [76]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select date waktu from `sample data` "

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

         waktu
0   2020-01-01
1   2020-01-01
2   2020-01-01
3   2020-01-01
4   2020-01-01
..         ...
145 2020-01-01
146 2020-01-01
147 2020-01-01
148 2020-01-01
149 2020-01-01

[150 rows x 1 columns]

In [77]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select id, geometry lokasi, level level_5 from `sample data` where level = 5 group by id order by id desc limit 30"

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

         id                                             lokasi  level_5
0   8231087  {'type': 'MultiLineString', 'coordinates': [[[...        5
1   8231085  {'type': 'MultiLineString', 'coordinates': [[[...        5
2   8231042  {'type': 'MultiLineString', 'coordinates': [[[...        5
3   8231041  {'type': 'MultiLineString', 'coordinates': [[[...        5
4   8231029  {'type': 'MultiLineString', 'coordinates': [[[...        5
5   8231019  {'type': 'MultiLineString', 'coordinates': [[[...        5
6   8231018  {'type': 'MultiLineString', 'coordinates': [[[...        5
7   8230996  {'type': 'MultiLineString', 'coordinates': [[[...        5
8   8230995  {'type': 'MultiLineString', 'coordinates': [[[...        5
9   8230994  {'type': 'MultiLineString', 'coordinates': [[[...        5
10  8230983  {'type': 'MultiLineString', 'coordinates': [[[...        5

In [78]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select level, count(level) level_5 from `sample data` where level = 5 order by id desc limit 30"

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

   level  level_5
0      5       11

In [79]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select level, count(level) level_ from `sample data` group by level order by level_ desc"

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

   level  level_
0      2      57
1      3      46
2      4      21
3      1      15
4      5      11

In [80]:
connection = db.connect(
                        host="localhost",
                        database="junior_data_analyst",
                        user="root",
                        password="MySQL"
                       )

query = "select geometry lokasi, hour, avg_speed_kmh speed from `sample data` where hour >= 15 && hour <=18 group by lokasi order by id desc, speed asc limit 7"

data = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Close")

display(data)

MySQL Close

                                              lokasi  hour    speed
0  {'type': 'MultiLineString', 'coordinates': [[[...    17  15.9911
1  {'type': 'MultiLineString', 'coordinates': [[[...    16  20.5400